emacs.d/settings.org
* Use-package
#+BEGIN_SRC emacs-lisp
(require 'package)
(setq package-enable-at-startup nil)
(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
(add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-when-compile
  (require 'use-package))
(require 'diminish)
(require 'bind-key)

#+END_SRC
* use "swiper" for search

* Turn off menu bar
#+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
#+END_SRC
* Line
** Hide minor modes in the mode line
#+BEGIN_SRC emacs-lisp
(setq rm-blacklist ".*")
#+END_SRC
** Display battery
#+BEGIN_SRC emacs-lisp
(display-battery-mode 1)
#+END_SRC
** Display Time
#+BEGIN_SRC emacs-lisp
(display-time-mode 1)
(setq display-time-string-forms
       '((propertize (concat " " 24-hours ":" minutes " "))))
#+END_SRC
* Open URLs with xdg-open
#+BEGIN_SRC emacs-lisp
(setq browse-url-browser-function 'browse-url-xdg-open)
#+END_SRC

* Ido-mode
#+BEGIN_SRC emacs-lisp
(setq ido-enable-flex-matching t)
(setq ido-everywhere t)
(ido-mode 1)
#+END_SRC
  
* Magit
#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t)

#+END_SRC
